kopiro/esp8266-deerma-humidifier/src/main.cpp
  autoconfPayload["max_humidity"] = 99;
  autoconfPayload["min_humidity"] = 0;

  autoconfPayload["state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["state_value_template"] =
      "{\"state\": \"{{value_json.state}}\"}";
  autoconfPayload["payload_on"] = "{\"state\": \"on\"}";
  autoconfPayload["payload_off"] = "{\"state\": \"off\"}";
  autoconfPayload["command_topic"] = MQTT_TOPIC_COMMAND;
  autoconfPayload["state_value_template"] =
      "{\"state\": \"{{value_json.state}}\"}";
  autoconfPayload["payload_on"] = "{\"state\": \"on\"}";
  autoconfPayload["payload_off"] = "{\"state\": \"off\"}";

  StaticJsonDocument<64> modesDoc;
  JsonArray modes = modesDoc.to<JsonArray>();

  autoconfPayload["target_humidity_state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["target_humidity_command_topic"] = MQTT_TOPIC_COMMAND;
  autoconfPayload["target_humidity_state_template"] =
      "{{value_json.humiditySetpoint | int}}";
  autoconfPayload["target_humidity_command_template"] =
      "{\"humiditySetpoint\": {{value | int}}}";

  modes.add("setpoint");
  modes.add("low");
  modes.add("medium");
  modes.add("high");

  autoconfPayload["modes"] = modes;
  autoconfPayload["mode_state_topic"] = MQTT_TOPIC_STATE;
  autoconfPayload["mode_command_topic"] = MQTT_TOPIC_COMMAND;
  autoconfPayload["mode_state_template"] = "{{value_json.mode}}";
  autoconfPayload["mode_command_template"] = "{\"mode\": \"{{value}}\"}";

  serializeJson(autoconfPayload, mqttPayload);
  sendMQTTMessage(MQTT_TOPIC_AUTOCONF_HUMIDIFIER, mqttPayload, true);
}

char serialRxBuf[255];
char serialTxBuf[255];

boolean DebugEnabled = false;
boolean UARTEnabled = true;

#define PROP_POWER_SIID 2
#define PROP_POWER_PIID 1

#define PROP_READ_SIID 3
#define PROP_HUMIDITY_PIID 1
#define PROP_TEMPERATURE_PIID 7

#define PROP_SET_SIID 2
#define PROP_HUMIDITY_MODE_PIID 5
#define PROP_HUMIDITY_SETPOINT_PIID 6

#define PROP_SOUND_SIID 5
#define PROP_SOUND_ENABLED_PIID 1

#define PROP_LED_SIID 6
#define PROP_LED_ENABLED_PIID 1

#define PROP_WATER_TANK_SIID 7
#define PROP_WATER_TANK_EMPTY_PIID 1
#define PROP_WATER_TANK_REMOVED_PIID 2

const int DOWNSTREAM_QUEUE_SIZE = 50;
const int DOWNSTREAM_QUEUE_ELEM_SIZE = 51;

char downstreamQueue[DOWNSTREAM_QUEUE_SIZE][DOWNSTREAM_QUEUE_ELEM_SIZE];
int downstreamQueueIndex = -1;
char nextDownstreamMessage[DOWNSTREAM_QUEUE_ELEM_SIZE] = "";

void saveConfig() {
  SerialDebug.println("Saving config...");

  // Initialize SPIFFS if not already done
  if (!SPIFFS.begin()) {
    SerialDebug.println("Failed to initialize SPIFFS");
    return;
  }

  DynamicJsonDocument json(512);
  const char* server = wifi_param_mqtt_server.getValue();
  const char* username = wifi_param_mqtt_username.getValue();
  const char* password = wifi_param_mqtt_password.getValue();

  // Copy username and password (can be empty)
  json["mqtt_server"] = server;
  json["mqtt_username"] = username;
  json["mqtt_password"] = password;

  File configFile = SPIFFS.open("/config.json", "w");
  if (!configFile) {
    SerialDebug.println("Failed to open config file for writing");
    return;
  }

  if (serializeJson(json, configFile) == 0) {
    SerialDebug.println("Failed to write config file");
    configFile.close();
    return;
  }

  configFile.close();
  SerialDebug.printf("Saved JSON: %s\n", json.as<String>().c_str());
}

void loadConfig() {
  SerialDebug.println("Loading config");

  // Initialize SPIFFS
  if (!SPIFFS.begin()) {
    SerialDebug.println("Failed to initialize SPIFFS");
    return;
  }

  if (!SPIFFS.exists("/config.json")) {
    SerialDebug.println("Config file not found, please configure the ESP by "
                        "connecting to its Wi-Fi hotspot");
    return;
  }

  File configFile = SPIFFS.open("/config.json", "r");
  if (!configFile) {
    SerialDebug.println("Failed to open config file");
    return;
  }

  const size_t size = configFile.size();
  if (size > 512) {
    SerialDebug.println("Config file too large");
    configFile.close();
    return;
  }

  std::unique_ptr<char[]> buf(new char[size + 1]);
  configFile.readBytes(buf.get(), size);
  buf[size] = '\0'; // Ensure null termination
  configFile.close();

  DynamicJsonDocument json(512);
  DeserializationError error = deserializeJson(json, buf.get());
  if (error) {
    SerialDebug.printf("Failed to parse config file: %s\n", error.c_str());
    return;
  }

  // Copy MQTT server with size check
  const char* server = json["mqtt_server"];
  if (server && strlen(server) < sizeof(mqtt_server)) {
    strncpy(mqtt_server, server, sizeof(mqtt_server) - 1);
    mqtt_server[sizeof(mqtt_server) - 1] = '\0';
  }

  // Copy username with size check
  const char* username = json["mqtt_username"];
  if (username && strlen(username) < sizeof(mqtt_username)) {
    strncpy(mqtt_username, username, sizeof(mqtt_username) - 1);
    mqtt_username[sizeof(mqtt_username) - 1] = '\0';
  }

  // Copy password with size check
  const char* password = json["mqtt_password"];
  if (password && strlen(password) < sizeof(mqtt_password)) {
    strncpy(mqtt_password, password, sizeof(mqtt_password) - 1);
    mqtt_password[sizeof(mqtt_password) - 1] = '\0';
  }

  // Update WiFi manager parameters
  wifi_param_mqtt_server.setValue(mqtt_server, sizeof(mqtt_server));
  wifi_param_mqtt_username.setValue(mqtt_username, sizeof(mqtt_username));
  wifi_param_mqtt_password.setValue(mqtt_password, sizeof(mqtt_password));

  SerialDebug.printf("Config JSON: %s\n", json.as<String>().c_str());
}

void setupMDNS() {
  if (MDNS.begin(BOARD_ID)) {
    SerialDebug.println("MDNS responder started");
  } else {
    SerialDebug.println("MDNS responder got an error");
  }
}

void setupGeneric() {
  SerialDebug.begin(9600);
  SerialDebug.println("BOOT");

  pinMode(STATUS_PIN, OUTPUT);
  digitalWrite(STATUS_PIN, HIGH);

  pinMode(FLASH_PIN, INPUT_PULLUP);

  BOARD_ID = String(BOARD_PREFIX) + "-" + String(ESP.getChipId(), HEX);
  SerialDebug.printf("Board Identifier: %s\n", BOARD_ID.c_str());

  MQTT_TOPIC_STATE = BOARD_ID + "/state";
  MQTT_TOPIC_COMMAND = BOARD_ID + "/command";
  MQTT_TOPIC_DEBUG = BOARD_ID + "/debug";
  MQTT_TOPIC_AVAILABILITY = BOARD_ID + "/availability";

  // Home Assistant auto-discovery topics
  MQTT_TOPIC_AUTOCONF_TEMPERATURE_SENSOR = String("homeassistant/sensor/") +
                                           BOARD_ID +
                                           "/temperature/config";
  MQTT_TOPIC_AUTOCONF_HUMIDITY_SENSOR =
      String("homeassistant/sensor/") + BOARD_ID + "/humidity/config";
  MQTT_TOPIC_AUTOCONF_WIFI_SENSOR =
      String("homeassistant/sensor/") + BOARD_ID + "/wifi/config";
  MQTT_TOPIC_AUTOCONF_WATER_TANK_SENSOR =
      String("homeassistant/binary_sensor/") + BOARD_ID +
      "/water_tank/config";
  MQTT_TOPIC_AUTOCONF_HUMIDIFIER =
      String("homeassistant/switch/") + BOARD_ID + "/humidifier/config";
  MQTT_TOPIC_AUTOCONF_SOUND_SWITCH =
      String("homeassistant/switch/") + BOARD_ID + "/sound/config";
  MQTT_TOPIC_AUTOCONF_LED_SWITCH =
      String("homeassistant/switch/") + BOARD_ID + "/led/config";

  loadConfig();
}

void setupWifi() {
  if (WiFi.status() == WL_NO_SHIELD) {
    SerialDebug.println("WiFi shield not present");
    return;
  }

  WiFi.hostname(BOARD_ID);

