kopiro/esp8266-deerma-humidifier/src/main.cpp
  wifiManager.setConfigPortalBlocking(false);
  wifiManager.setDebugOutput(true);
  wifiManager.setSaveParamsCallback(saveConfig);

  wifiManager.addParameter(&wifi_param_mqtt_server);
  wifiManager.addParameter(&wifi_param_mqtt_username);
  wifiManager.addParameter(&wifi_param_mqtt_password);

  if (WiFi.status() == WL_CONNECTED || wifiManager.autoConnect(BOARD_ID.c_str())) {
    // If we are connected to autoConnect, start the web portal for the configuration screen,
    // as otherwise it would not be accessible.
    WiFi.mode(WIFI_STA); // Force the connection to be STA, not AP
    wifiManager.startWebPortal();
  } else {
    SerialDebug.println("Failed to connect to WiFi");
  }
}

void loopWifi() { wifiManager.process(); }


boolean shouldUpdateState = false;

void queueDownstreamMessage(const char *message) {
  if (downstreamQueueIndex >= DOWNSTREAM_QUEUE_SIZE - 1) {
    SerialDebug.printf("Error: Queue is full. Dropping message: <%s>\n",
                       message);
    return;
  }

  downstreamQueueIndex++;
  strncpy(downstreamQueue[downstreamQueueIndex], message, DOWNSTREAM_QUEUE_ELEM_SIZE - 1);
  downstreamQueue[downstreamQueueIndex][DOWNSTREAM_QUEUE_ELEM_SIZE - 1] = '\0';
}


void sendNetworkStatus(boolean isConnected) {
  queueDownstreamMessage("MIIO_net_change cloud");
}

void clearDownstreamQueueAtIndex(int index) {
  memset(downstreamQueue[index], 0, sizeof(downstreamQueue[index]));
}

void fillNextDownstreamMessage() {
  if (downstreamQueueIndex < 0) {
    strncpy(nextDownstreamMessage, "none", DOWNSTREAM_QUEUE_ELEM_SIZE - 1);
    nextDownstreamMessage[DOWNSTREAM_QUEUE_ELEM_SIZE - 1] = '\0';
  } else if (downstreamQueueIndex == 0) {
    strncpy(nextDownstreamMessage, downstreamQueue[0], DOWNSTREAM_QUEUE_ELEM_SIZE - 1);
    nextDownstreamMessage[DOWNSTREAM_QUEUE_ELEM_SIZE - 1] = '\0';
    downstreamQueueIndex--;
  } else {
    strncpy(nextDownstreamMessage, downstreamQueue[0], DOWNSTREAM_QUEUE_ELEM_SIZE - 1);
    nextDownstreamMessage[DOWNSTREAM_QUEUE_ELEM_SIZE - 1] = '\0';
    for (int i = 0; i < downstreamQueueIndex; i++) {
      strncpy(downstreamQueue[i], downstreamQueue[i + 1], DOWNSTREAM_QUEUE_ELEM_SIZE - 1);
      downstreamQueue[i][DOWNSTREAM_QUEUE_ELEM_SIZE - 1] = '\0';
    }
    downstreamQueueIndex--;
  }
}

void resetWifiSettingsAndReboot() {
  SerialDebug.println("Resetting WiFi settings and rebooting");
  wifiManager.resetSettings();
  sendNetworkStatus(false);
  delay(3000);
  ESP.restart();
}

void mqttConnect() {
  if (strlen(mqtt_server) == 0) {
    SerialDebug.println("MQTT server not configured, skipping connection");
    return;
  }
  
  SerialDebug.printf("Connecting to MQTT server: host = %s (user: %s : pass: %s)... ", mqtt_server, mqtt_username, mqtt_password);

  if (mqttClient.connect(BOARD_ID.c_str(), mqtt_username, mqtt_password, MQTT_TOPIC_AVAILABILITY.c_str(), 1, true, "offline")) {
    SerialDebug.println("connected");

    mqttClient.subscribe(MQTT_TOPIC_COMMAND.c_str());

    // Subscribe to HA restart and send the availability message
    mqttClient.subscribe("homeassistant/status");
    sendHAAutoDiscovery();

    sendMQTTMessage(MQTT_TOPIC_AVAILABILITY, "online", true);

    sendNetworkStatus(true);
  } else {
    SerialDebug.println("Unable to connect to MQTT broker");
  }
}


void loopMDNS() { MDNS.update(); }

void loopMQTT() {
  if (mqttClient.connected()) {
    mqttClient.loop();
    return;
  }

  if (millis() < mqttLastTime + MQTT_POLLING_TIMEOUT) {
    return;
  }

  SerialDebug.println("Connection to MQTT lost, reconnecting...");
  mqttLastTime = millis();

  mqttConnect();
}

void queuePropertyChange(int siid, int piid, const char *value) {
  String msg = "set_properties " + String(siid) + " " + String(piid) + " " +
               String(value);
  queueDownstreamMessage(msg.c_str());
}

void queuePropertyChange(int siid, int piid, char *value) {
  String msg = "set_properties " + String(siid) + " " + String(piid) + " " +
               String(value);
  queueDownstreamMessage(msg.c_str());
}

void setPowerState(boolean powerOn) {
  queuePropertyChange(PROP_POWER_SIID, PROP_POWER_PIID,
                      powerOn ? "true" : "false");
}

void setLEDState(boolean ledEnabled) {
  queuePropertyChange(PROP_LED_SIID, PROP_LED_ENABLED_PIID,
                      ledEnabled ? "true" : "false");
}

void setSoundState(boolean soundEnabled) {
  queuePropertyChange(PROP_SOUND_SIID, PROP_SOUND_ENABLED_PIID,
                      soundEnabled ? "true" : "false");
}

void setHumidityMode(humMode_t mode) {
  queuePropertyChange(PROP_SET_SIID, PROP_HUMIDITY_MODE_PIID,
                      String(mode).c_str());
}

void setHumiditySetpoint(uint8_t value) {
  uint8_t clampedValue = value > 60 ? 60 : (value < 40 ? 40 : value);
  queuePropertyChange(PROP_SET_SIID, PROP_HUMIDITY_SETPOINT_PIID,
                      String(clampedValue).c_str());
}

void publishState() {
  SerialDebug.println("Publishing new state");

  DynamicJsonDocument wifiJson(192);
  DynamicJsonDocument stateJson(604);
  String payload;

  wifiJson["ssid"] = WiFi.SSID();
  wifiJson["ip"] = WiFi.localIP().toString();
  wifiJson["rssi"] = WiFi.RSSI();

  stateJson["state"] = state.powerOn ? "on" : "off";

  switch (state.mode) {
  case (humMode_t)setpoint:
    stateJson["mode"] = "setpoint";
    break;
  case (humMode_t)low:
    stateJson["mode"] = "low";
    break;
  case (humMode_t)medium:
    stateJson["mode"] = "medium";
    break;
  case (humMode_t)high:
    stateJson["mode"] = "high";
    break;
  default:
    stateJson["mode"] = "unknown";
  }

  stateJson["humiditySetpoint"] = state.humiditySetpoint;

  stateJson["humidity"] = state.currentHumidity;
  stateJson["temperature"] = state.currentTemperature;

  stateJson["sound"] = state.soundEnabled ? "on" : "off";
  stateJson["led"] = state.ledEnabled ? "on" : "off";

  stateJson["waterTank"] = state.waterTankInstalled
                               ? (state.waterTankEmpty ? "empty" : "full")
                               : "missing";

  stateJson["wifi"] = wifiJson.as<JsonObject>();

  stateJson["__debug"] = DebugEnabled;
  stateJson["__uart"] = UARTEnabled;

  serializeJson(stateJson, payload);
  SerialDebug.printf("State JSON: %s\n", payload.c_str());

  sendMQTTMessage(MQTT_TOPIC_STATE, payload, false);
}


void loopUART() {
  if (!Serial.available()) {
    return;
  }

  memset(serialRxBuf, 0, sizeof(serialRxBuf));
  Serial.readBytesUntil('\r', serialRxBuf, 250);

  if (DebugEnabled) {
    sendMQTTMessage(MQTT_TOPIC_DEBUG, serialRxBuf, false);
  }

