kopiro/esp8266-deerma-humidifier/src/main.cpp
  SerialDebug.printf("UART says: <%s>\n", serialRxBuf);

  if (strncmp(serialRxBuf, "properties_changed", 18) == 0) {
    int propSiid = 0;
    int propPiid = 0;
    char propValue[6] = "";

    int propChanged = sscanf(serialRxBuf, "properties_changed %d %d %s",
                             &propSiid, &propPiid, propValue);

    if (propChanged == 3) {
      SerialDebug.printf("Property changed: %d %d %s\n", propSiid, propPiid,
                         propValue);

      if (propSiid == PROP_POWER_SIID && propPiid == PROP_POWER_PIID) {
        state.powerOn = strncmp(propValue, "true", 4) == 0;
        SerialDebug.printf("New power status: <%s>\n",
                           state.powerOn ? "on" : "off");
      } else if (propSiid == PROP_SET_SIID &&
                 propPiid == PROP_HUMIDITY_MODE_PIID) {
        state.mode = (humMode_t)atoi(propValue);
        SerialDebug.printf("New humidityMode: <%d>\n", state.mode);
      } else if (propSiid == PROP_SET_SIID &&
                 propPiid == PROP_HUMIDITY_SETPOINT_PIID) {
        state.humiditySetpoint = atoi(propValue);
        SerialDebug.printf("New humiditySetpoint: <%d>\n",
                           state.humiditySetpoint);
      } else if (propSiid == PROP_READ_SIID && propPiid == PROP_HUMIDITY_PIID) {
        state.currentHumidity = atoi(propValue);
        SerialDebug.printf("New currentHumidity: <%d>\n",
                           state.currentHumidity);
      } else if (propSiid == PROP_READ_SIID &&
                 propPiid == PROP_TEMPERATURE_PIID) {
        state.currentTemperature = atoi(propValue);
        SerialDebug.printf("New currentTemperature: <%d>\n",
                           state.currentTemperature);
      } else if (propSiid == PROP_LED_SIID &&
                 propPiid == PROP_LED_ENABLED_PIID) {
        state.ledEnabled = strncmp(propValue, "true", 4) == 0;
        SerialDebug.printf("New ledEnabled: <%s>\n",
                           state.ledEnabled ? "true" : "false");
      } else if (propSiid == PROP_SOUND_SIID &&
                 propPiid == PROP_SOUND_ENABLED_PIID) {
        state.soundEnabled = strncmp(propValue, "true", 4) == 0;
        SerialDebug.printf("New soundEnabled: <%s>\n",
                           state.soundEnabled ? "true" : "false");
      } else if (propSiid == PROP_WATER_TANK_SIID &&
                 propPiid == PROP_WATER_TANK_REMOVED_PIID) {
        state.waterTankInstalled = !(strncmp(propValue, "true", 4) == 0);
        SerialDebug.printf("New waterTankInstalled: <%s>\n",
                           state.waterTankInstalled ? "true" : "false");
      } else if (propSiid == PROP_WATER_TANK_SIID &&
                 propPiid == PROP_WATER_TANK_EMPTY_PIID) {
        state.waterTankEmpty = strncmp(propValue, "true", 4) == 0;
        SerialDebug.printf("New waterTankEmpty: <%s>\n",
                           state.waterTankEmpty ? "true" : "false");
      } else {
        SerialDebug.printf("Unknown property: <%s>\n", serialRxBuf);
      }

      shouldUpdateState = true;
    }

    Serial.print("ok\r");
    return;
  }

  if (strncmp(serialRxBuf, "get_down", 8) == 0) {
    if (shouldUpdateState == true) {
      shouldUpdateState = false;
      publishState();
    }

    fillNextDownstreamMessage();

    if (strncmp(nextDownstreamMessage, "none", 4) != 0) {
      SerialDebug.printf("Sending: %s\n", nextDownstreamMessage);
    }

    memset(serialTxBuf, 0, sizeof(serialTxBuf));
    snprintf(serialTxBuf, sizeof(serialTxBuf), "down %s\r", nextDownstreamMessage);
    Serial.print(serialTxBuf);

    return;
  }

  if (strncmp(serialRxBuf, "net", 3) == 0) {
    // We need to always respond with cloud because otherwise the connection to the humidifier will break for some reason
    Serial.print("cloud\r");
    return;
  }

  if (strncmp(serialRxBuf, "mcu_version", 11) == 0 ||
      strncmp(serialRxBuf, "model", 5) == 0 ||
      strncmp(serialRxBuf, "event_occured", 13) == 0) {
    Serial.print("ok\r");
    return;
  }

  if (strncmp(serialRxBuf, "restore", 7) == 0) {
    resetWifiSettingsAndReboot();
    return;
  }

  if (strncmp(serialRxBuf, "result", 6) == 0) {
    Serial.print("ok\r");
    return;
  }

  SerialDebug.printf("UART unexpected: %s\n", serialRxBuf);
}

void mqttCallback(char *_topic, byte *_payload, unsigned int length) {
  String topic = String(_topic);
  String payload = String((char*)_payload).substring(0, length);

  SerialDebug.printf("MQTT callback with topic <%s> and payload <%s>\n", topic.c_str(), payload.c_str());

  if (topic == "homeassistant/status") {
    if (payload == "online") {
      sendHAAutoDiscovery();
      sendMQTTMessage(MQTT_TOPIC_AVAILABILITY, "online", true);
    }
    return;
  }

  if (topic == "command") {
    DynamicJsonDocument commandJson(256);
    DeserializationError err = deserializeJson(commandJson, _payload);

    if (err) {
      SerialDebug.println("Error deserializing JSON");
      return;
    }

    String stateCommand = commandJson["state"].as<String>();
    String modeCommand = commandJson["mode"].as<String>();
    String soundCommand = commandJson["sound"].as<String>();
    String ledCommand = commandJson["led"].as<String>();
    String command = commandJson["command"].as<String>();

    long humiditySetpointCommand = commandJson["humiditySetpoint"] | -1;

    if (stateCommand == "off") {
      setPowerState(false);
    } else if (stateCommand == "on") {
      setPowerState(true);
    }

    if (modeCommand == "low") {
      setHumidityMode((humMode_t)low);
    } else if (modeCommand == "medium") {
      setHumidityMode((humMode_t)medium);
    } else if (modeCommand == "high") {
      setHumidityMode((humMode_t)high);
    } else if (modeCommand == "setpoint") {
      setHumidityMode((humMode_t)setpoint);
    }

    if (soundCommand == "off") {
      setSoundState(false);
    } else if (soundCommand == "on") {
      setSoundState(true);
    }

    if (ledCommand == "off") {
      setLEDState(false);
    } else if (ledCommand == "on") {
      setLEDState(true);
    }

    if (humiditySetpointCommand > -1) {
      setHumiditySetpoint((uint8_t)humiditySetpointCommand);
    }

    // Internal commands
    if (command == "__reboot") {
      ESP.restart();
    } else if (command == "__reset") {
      resetWifiSettingsAndReboot();
    } else if (command == "__debug") {
      DebugEnabled = true;
    } else if (command == "__undebug") {
      DebugEnabled = false;
    } else if (command == "__enableUART") {
      UARTEnabled = true;
    } else if (command == "__disableUART") {
      UARTEnabled = false;
    } else if (command == "__publishState") {
      publishState();
    }
  }
}

void setupMQTT() {
  mqttClient.setClient(wifiClient);

  mqttClient.setServer(mqtt_server, 1883);
  mqttClient.setKeepAlive(10);
  mqttClient.setBufferSize(2048);
  mqttClient.setCallback(mqttCallback);

  mqttConnect();
}


void setupUART() {
  Serial.begin(115200);
  Serial.swap();
  delay(1000);
  sendNetworkStatus(false);
}

void setupOTA() {
  ArduinoOTA.onStart([]() {});
  ArduinoOTA.onEnd([]() {});
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {});
  ArduinoOTA.onError([](ota_error_t error) {});
  ArduinoOTA.setHostname(BOARD_ID.c_str());
  ArduinoOTA.setPassword(BOARD_ID.c_str());
  ArduinoOTA.begin();
}

void loopOTA() { ArduinoOTA.handle(); }


void setup() {
  setupUART();

  setupGeneric();

  setupWifi();
  setupMDNS();
  setupOTA();
  setupMQTT();
}

void loop() {
  if (UARTEnabled) {
    loopUART();
  }

  loopWifi();
  loopMDNS();
  loopOTA();
  loopMQTT();
}